ABOUT_BMI = ('Body Mass Index (BMI) позволяет оценивать, какой вес является'
             ' нормальным, недостаточным или избыточным\nДля его определения'
             ' мне понадобится твой вес и рост')

ABOUT_CALORIES = ('Суточная норма калорий — это количество энергии,'
                  ' необходимое организму для функционирования и'
                  ' поддержания обмена веществ\nДавай определим'
                  ' твою норму калорий в день. Для этого мне понадобится'
                  ' несколько показателей...')

SEND_WEIGHT = 'Напиши мне свой вес (кг)'

SEND_HEIGHT = 'Напиши мне свой рост (см)'

SEND_AGE = 'Напиши мне свой возраст'

SEND_WORKOUT = 'Отлично! Теперь пришли мне свою тренировку в текстовом формате'

SELECT_GENDER = 'Выбери свой пол'

SELECT_ACTIVITY_DEGREE = 'Выбери свою степень акивности'

BMI_RESULT = 'Твой показатель BMI = {bmi}'

CALORIES_RESULT = 'Твоя суточная норма калорий находится в диапазоне от {start} до {end}'

SEND_WORKOUT_DATE = 'Напиши мне дату тренировки в формате дд.мм.гггг (или выбери с клавиатуры)'

INCORRECT_DATE = 'Неправильный формат даты'

WORKOUT_SUCCESS = 'Тренировка успешно сохранена'

SOMETHING_WENT_WRONG = 'Что-то пошло не так... 😿'

ADD_WORKOUT = 'Ты хочешь добавить тренировку?\nПрекрасно!'

NAME_SET_SUCCESS = 'Отлично! Теперь я знаю, что тебя зовут {name}'

NAME_IS_INVALID = 'Имя должно быть от 1 до 50 символов'
